export function getYearOptions(startYear = 1900): number[] {
  const currentYear = new Date().getFullYear();

  return Array.from(
    { length: currentYear - startYear + 1 },
    (_, i) => currentYear - i
  );
}

export const NO_CONDITION_ID = 0;

export const healthOptions = [
  { value: NO_CONDITION_ID, label: '질병없음' },
  { value: 1, label: '천식' },
  { value: 2, label: '고혈압' },
  { value: 3, label: '안구건조증' },
  { value: 4, label: '햇빛알러지' },
  { value: 5, label: '꽃가루알러지' },
  { value: 6, label: '비염' },
  { value: 7, label: '당뇨' },
  { value: 8, label: '심장질환' },
  { value: 9, label: '피부염/아토피' },
  { value: 10, label: '관절염' },
  { value: 11, label: '뇌졸중' },
  { value: 12, label: '어린이' },
  { value: 13, label: '고령' },
];

export const regionOptions = {
  "특별시/광역시": [
    "서울특별시",
    "부산광역시",
    "대구광역시",
    "인천광역시",
    "광주광역시",
    "대전광역시",
    "울산광역시",
    "세종특별자치시"
  ],
  "경기도": [
    "수원특례시","고양특례시","용인특례시","화성특례시",
    "성남시","부천시","안산시","안양시","평택시","시흥시",
    "김포시","광주시","광명시","하남시","군포시","오산시",
    "이천시","안성시","의왕시","양주시","구리시","포천시",
    "의정부시","남양주시","파주시","여주시","동두천시"
  ],
  "강원특별자치도": ["춘천시","원주시","강릉시","동해시","태백시","속초시","삼척시"],
  "충청북도": ["청주시","충주시","제천시"],
  "충청남도": ["천안시","아산시","서산시","당진시","보령시","공주시","논산시","계룡시"],
  "전북특별자치도": ["전주시","군산시","익산시","정읍시","남원시","김제시"],
  "전라남도": ["여수시","순천시","목포시","광양시","나주시"],
  "경상북도": ["포항시","구미시","경산시","경주시","안동시","김천시","영주시","영천시","상주시","문경시"],
  "경상남도": ["창원특례시","김해시","양산시","진주시","거제시","통영시","사천시","밀양시"],
  "제주특별자치도": ["제주행정시","서귀포행정시"],
};

export const commuteOptions = [
  '00:00', '01:00', '02:00', '03:00', '04:00',
  '05:00', '06:00', '07:00', '08:00', '09:00',
  '10:00', '11:00', '12:00', '13:00', '14:00',
  '15:00', '16:00', '17:00', '18:00', '19:00',
  '20:00', '21:00', '22:00', '23:00'
];
